{
  "project": "Tower Survivors",
  "branchName": "ralph/ui-overhaul",
  "description": "Game UI Overhaul - Reposition and restyle all HUD elements to match target design screenshot",
  "userStories": [
    {
      "id": "US-040",
      "title": "Redesign Top HUD Bar - Wave Counter and Health Bar",
      "description": "As a player, I want the top HUD to show the wave counter on the left and health bar in the center so the most critical info is clearly visible.",
      "acceptanceCriteria": [
        "Modify HUD.cs to reposition wave counter to top-left as 'WAVE [number]' with bold number styling using TextMeshPro",
        "Reposition health bar to top-center with a heart icon (use TMP text '♥' if no sprite) on its left side",
        "Health bar uses red fill color for current HP portion and dark/gray for depleted portion",
        "HP text displays to the right of the bar as '[current] / [max]' (e.g. '720 / 1000')",
        "Hide or remove survival time text, wave progress slider, Next Wave timer, and Enemies Remaining text from HUD (not in target design)",
        "Use Unity MCP to update HUDCanvas layout: reposition existing GoldText, WaveText, and health slider elements",
        "All elements still update correctly from existing WaveManager and TowerHealth events",
        "Verify layout in Unity Editor via Unity MCP read_console or scene inspection"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-041",
      "title": "Add Pause Button to Top-Right",
      "description": "As a player, I want a pause button in the top-right corner so I can pause the game easily.",
      "acceptanceCriteria": [
        "Use Unity MCP to create a Button UI element in HUDCanvas anchored to top-right corner",
        "Button displays '||' or '❚❚' text as pause icon using TextMeshPro",
        "Button has dark semi-transparent background (#1a1a2e with 0.8 alpha)",
        "Clicking the button calls TowerSurvivorsGameManager.PauseGame()",
        "Add the button reference to HUD.cs and wire the onClick event",
        "Button only visible during GameState.Playing",
        "Verify button appears and is clickable via Unity MCP"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-042",
      "title": "Move Currency Display to Bottom-Right",
      "description": "As a player, I want to see my gold in the bottom-right corner with a coin icon so I always know what I can afford.",
      "acceptanceCriteria": [
        "Use Unity MCP to reposition the gold text element from top-left to bottom-right of HUDCanvas",
        "Add a coin icon to the left of the gold amount (use TMP text '⊙' or '●' as placeholder if no sprite asset)",
        "Format gold amount with commas using string format N0 (e.g. '1,250')",
        "Gold text and icon use warm gold/orange color (#FFB347 or similar)",
        "Dark semi-transparent background panel behind the currency display",
        "Update HUD.cs UpdateGoldDisplay() method to use comma formatting",
        "Display still updates in real-time from GoldManager.OnGoldChanged event",
        "Verify layout via Unity MCP"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-043",
      "title": "Redesign Shop to Compact 2x6 Grid Layout",
      "description": "As a player, I want the shop displayed as a compact grid at the bottom-center so I can quickly browse and buy items.",
      "acceptanceCriteria": [
        "Modify ShopUI.cs to replace the current tabbed scrollable list with a 2-row x 6-column GridLayoutGroup",
        "Use Unity MCP to restructure ShopPanel: remove tab buttons, replace ScrollRect with GridLayoutGroup container",
        "Grid is anchored to bottom-center of screen, positioned above the equipped weapons bar area",
        "Each grid cell has dark semi-transparent background card (#1a1a2e with 0.9 alpha) with subtle border",
        "Weapons and upgrades are mixed together in the grid (no separate tabs)",
        "ShopUI loads both WeaponData and UpgradeData and populates up to 12 grid slots",
        "Modify ShopItemUI.cs to show compact card: small icon centered and price number below it only (no name/description text)",
        "Items that cannot be afforded appear visually dimmed (reduce alpha to 0.4)",
        "Clicking a card still purchases the item using existing purchase logic",
        "Verify grid layout via Unity MCP"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-044",
      "title": "Add Shop Refresh Button",
      "description": "As a player, I want a refresh button to re-roll available shop items.",
      "acceptanceCriteria": [
        "Use Unity MCP to create a Button below the currency display in bottom-right area",
        "Button displays '↻' or circular arrows text as refresh icon using TextMeshPro",
        "Button has dark background matching other UI elements",
        "Add RefreshShop() method to ShopUI.cs that shuffles/randomizes which items appear in the 12 grid slots from the full pool of available weapons and upgrades",
        "Wire button onClick to ShopUI.RefreshShop()",
        "Button has hover/pressed color state change",
        "Verify button works via Unity MCP"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-045",
      "title": "Add Placeholder Ability Button",
      "description": "As a player, I want a special ability button in the bottom-right UI area for future ability activation.",
      "acceptanceCriteria": [
        "Use Unity MCP to create a Button below the refresh button in bottom-right area",
        "Button displays '❄' or '✦' text as ability icon using TextMeshPro with cyan/blue tint color (#00BFFF)",
        "Button has dark background matching other UI elements",
        "Clicking logs 'Ability button pressed - coming soon' to console (placeholder only)",
        "Add minimal click handler in HUD.cs or create AbilityButtonUI.cs with just the log statement",
        "Button only visible during GameState.Playing",
        "Verify button appears via Unity MCP"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-046",
      "title": "Add Upgrade Quick-Buy Row in Bottom-Left",
      "description": "As a player, I want a row of upgrade icons in the bottom-left that I can quickly purchase.",
      "acceptanceCriteria": [
        "Create UpgradeQuickBuyUI.cs in Assets/_Tanks/Scripts/TowerSurvivors/UI/",
        "Script loads first 3 UpgradeData assets from Resources/UpgradeData/ folder",
        "Use Unity MCP to create a HorizontalLayoutGroup panel in bottom-left of HUDCanvas",
        "Each upgrade slot shows: upgrade icon (or colored square placeholder) and cost text below it",
        "Clicking a slot calls UpgradeManager.PurchaseUpgrade() with the corresponding UpgradeData",
        "Slots that cannot be afforded appear dimmed (alpha 0.4)",
        "Cost text updates after purchase to show next stack cost",
        "Subscribe to GoldManager.OnGoldChanged to update affordability visuals",
        "Panel only visible during GameState.Playing",
        "Verify layout via Unity MCP"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-047",
      "title": "Add Level Indicator in Bottom-Left",
      "description": "As a player, I want to see my current level displayed below the upgrade row.",
      "acceptanceCriteria": [
        "Use Unity MCP to create a panel below the upgrade quick-buy row in bottom-left of HUDCanvas",
        "Panel has green background color (#2d5a1e or similar green matching target screenshot)",
        "Shows upward arrow text '⬆' and 'Lv. [number]' using TextMeshPro",
        "Level value reads from current wave number via WaveManager (UI-only, no new game logic)",
        "Subscribe to WaveManager.OnWaveStarted event to update level number",
        "Add level indicator references and update logic to HUD.cs",
        "Panel only visible during GameState.Playing",
        "Verify layout via Unity MCP"
      ],
      "priority": 8,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-048",
      "title": "Redesign Weapon Inventory to Horizontal Bottom Bar",
      "description": "As a player, I want my equipped weapons as a horizontal row at the very bottom with an EQUIPPED label.",
      "acceptanceCriteria": [
        "Modify WeaponInventoryUI.cs to use horizontal layout instead of vertical",
        "Use Unity MCP to restructure WeaponInventoryPanel: reposition to bottom of screen as full-width horizontal bar",
        "Replace VerticalLayoutGroup with HorizontalLayoutGroup on the content container",
        "Add 'EQUIPPED' TextMeshPro label on the left side of the bar",
        "Each weapon shows as a small colored icon (color from weapon rarity) in horizontal row",
        "Show 8 empty placeholder slots with dim borders, filled slots show weapon icons",
        "Weapon fire pulse animation still works (existing scale + color change effect in WeaponInventoryUI.cs)",
        "Bar has dark semi-transparent background matching other UI elements",
        "Verify layout via Unity MCP"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-049",
      "title": "Apply Dark Theme and Color Scheme Across All UI",
      "description": "As a player, I want the UI to use the cohesive dark theme with accent colors shown in the target.",
      "acceptanceCriteria": [
        "Use Unity MCP to update background colors on all UI panels to dark semi-transparent (#1a1a2e, alpha 0.9)",
        "Health bar fill uses red color (#CC3333), depleted portion uses dark gray (#333333)",
        "Currency text and icon use gold/orange (#FFB347)",
        "Ability button icon uses cyan (#00BFFF)",
        "Level indicator panel uses green (#2d5a1e)",
        "Shop item cards use dark backgrounds (#1a1a2e) with subtle lighter border (#333344)",
        "All text uses white or near-white (#F0F0F0) for readability",
        "Wave text 'WAVE' label uses muted color, number uses bold white",
        "Update color constants in HUD.cs, ShopUI.cs, ShopItemUI.cs, WeaponInventoryUI.cs, and UpgradeQuickBuyUI.cs",
        "Verify visual appearance via Unity MCP"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    }
  ]
}
